Revit 2015 API
LayerModifier.Seperator Property
 The separator string that will follow this modifier in the export layer name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
[ObsoleteAttribute("This property is obsolete in Revit 2015. Use Separator instead.")]
public string Seperator { get; set; }
Visual Basic
<ObsoleteAttribute("This property is obsolete in Revit 2015. Use Separator instead.")> _
Public Property Seperator As String
	Get
	Set
Visual C++
[ObsoleteAttribute(L"This property is obsolete in Revit 2015. Use Separator instead.")]
public:
property String^ Seperator {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was NULL
See Also
LayerModifier Class
Autodesk.Revit.DB Namespace